Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/datatilsynet.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: These provide guidelines for determining which requirements should be set for the software.
nb: Disse legger føringer for kravene som må stilles til programvaren.

source: VIS is a central IT system for the Schengen countries.
nb: Visa Information System (VIS) er et felles IT-system for Schengenlandene.

source: purpose, accuracy, data minimisation, and resilience.
nb: nøyaktighet, dataminimalisert, lagring og robusthet.

source: The regulatory sandbox will provide free guidance to selected private and public organizations of different types and sizes and from different sectors.
nb: Den regulatoriske sandkassen skal tilby gratis veiledning til utvalgte private og offentlige virksomheter, av forskjellige typer og størrelser, på tvers av ulike sektorer.

source: Data collected via third parties in conjunction with at least one other criterion.
nb: Felles for mange er at de er svært omfattende, med fokus på detaljert og formell metodikk.

source: - Then there are some things we can measure and put in the system, which are starting to approach profiling, says Gjære.
nb: -Så er det noen ting vi kan måle og sette i system, som begynner å nærme seg profilering, sier Gjære.

source: Those that are unsafe should be forbidden, while those that are outdated, or contain known vulnerabilities, should be updated.
nb: De som er utrygge forbys og de som er utdaterte eller inneholder kjente sårbarheter oppdateres.

source: When is artificial intelligence responsible?
nb: Når er kunstig intelligens ansvarlig?

source: The Schengen Information System (and the second generation of the system — SIS II) is at the heart of Schengen cooperation.
nb: Informasjonssystemet i Schengen (og andre generasjon av systemet – SIS II) er en av hjørnestenene i Schengen-samarbeidet.

source: Lindstrand Trading AS has appealed the fine.
nb: Lindstrand Trading AS har klaga på vedtaket om pålegg og gebyr.

source: Examples of known vulnerabilities that should be investigated while running the software are Cross-site scripting and SQL injection.
nb: Eksempler på kjente sikkerhetsfeil som bør undersøkes mens programvaren kjøres er Cross-site scripting og SQL injection.

source: The organisation itself must decide what is relevant, and what type of training is required for individual employees.
nb: Virksomheten må selv finne ut hva som er relevant og hva den enkelte ansatte trenger opplæring i.

source: An understanding of data protection and information security is a prerequisite for developing software with data protection by design and by default.
nb: Kunnskap om personvern og informasjonssikkerhet er en forutsetning for å utvikle programvare med innebygd personvern.

source: To ensure that everyone in the organisation understands both the need for, and the risks associated with, data protection and security, the training needs to be structured.
nb: For at alle i virksomheten både skal forstå behovene for og risiko knyttet til personvern og sikkerhet, må opplæringen være strukturert.

source: The most important factor is to employ extensively used and well-reputed algorithms and methods, as well as a sufficiently long key.
nb: Det viktigste er at man benytter seg av utbredte og anerkjente algoritmer og metoder, sammen med en nøkkellengde som er tilstrekkelig.

source: It should also briefly describe what consequences these experiences may have for the development process, the business, and those affected.
nb: Den bør også kort beskrive hvordan disse erfaringene kan få konsekvenser for utviklingsløpet, virksomheten og berørte.

source: Unsafe functions and modules are handled by tools, such as OWASP Dependency
nb: Utrygge funksjoner og moduler håndteres av bibliotek, eksempelvis OWASP Dependency

source: The software must apply the highest privacy settings by default:
nb: Programvaren skal sette høyeste personverninnstilling som standard:

source: Data, platform, network, and software maintenance includes:
nb: Forvaltning av data, plattform, nett og programvare omfatter

source: newest and most updated version of the technology, cf. Article 25.
nb: mest oppdaterte versjonen av teknologien, jf. artikkel 25.

source: All privacy-friendly configurations need to be on by default.
nb: Sporing av en enhet skal være deaktivert som standard.

source: The highest version of TLS (Transport Layer Security) should be used, while SSL 3.0 (and lower) should be avoided, since they contain known weaknesses.
nb: Man bør bruke høyeste versjon av TLS (Transport Layer Security), og unngå SSL 3.0 (og lavere) som har kjente svakheter.

source: The following 3-6 moths these organizations will explore a juridical challenging terrain. Secure Practice
nb: De påfølgende 3-6 månedene skal følgende virksomheter utforske og utfordre et juridisk utfordrende terreng. NAV

source: They use a task management system, such as Jira or Confluence.
nb: De benytter et system for oppgavehåndtering, slik som Jira eller Confluence.

source: Does NAV need an explicit legal basis for predicting and / or using machine learning?
nb: Trenger NAV en uttrykkelig hjemmel for å predikere og/eller bruke maskinlæring?

source: Images, icons, and symbols may be used to make the information clearer and more intelligible.
nb: Bilder, ikoner og symboler kan også brukes for gjøre informasjonen tydeligere.

source: The response incident team should know whom to contact when necessary, and who is responsible for building, testing, and installing updates.
nb: Responsteamet skal vite hvem de skal kontakte etter behov og hvem som er i stand til å bygge, teste og installere oppdateringer.

source: We will start to reconsider what we write, what we do and who we have contact with.
nb: Det kan gjøres ved å tilby de beste, mest personaliserte tjenestene.

source: SIS II provides information on individuals who do not have the right to enter or stay in the Schengen Area, or on those who are sought in relation to criminal activities.
nb: SIS II gir informasjon om personer som ikke har rett til innreise eller opphold i Schengen-området, eller som er ettersøkt i forbindelse med straffbare handlinger.

source: Tools and supporting components should be risk-assessed and analysed for vulnerabilities.
nb: Verktøy og støttekomponenter bør risikovurderes og analyseres for sårbarheter.

source: If a vulnerability is revealed, mitigating measures must be implemented to achieve acceptable risk level for data protection and security.
nb: Ved funn skal sårbarhetsreduserende tiltak implementeres for å oppnå akseptabelt toleransnivå for personvern og sikkerhet.

source: Cryptographic modules which generate, protect and use private keys or session keys should be evaluated against Common Criteria, FIPS 140-2 or similar standards.
nb: Kryptografiske moduler som genererer, beskytter og bruker private nøkler eller sesjonsnøkler skal evalueres mot Common Criteria, FIPS 140-2 eller tilsvarende.

source: In addition, it must be clear what the different tools may be used for.
nb: I tillegg må det være klart hva ulike verktøy kan brukes til.

source: Session management, cookie use, and access control should also be tested to ensure that personal data cannot be retrieved by users who are not logged in.
nb: Sesjonshåndtering, cookie-bruk og tilgangskontroll bør også testes for å sikre at personopplysninger ikke kan hentes ut via brukere som ikke er logget inn.

source: Limit and minimise the exposure of unnecessary functionality and personal data in
nb: Begrens og minimer eksponering av unødvendig funksjonalitet og personopplysninger i

source: Examples include FileVault for MacOS, BitLocker for Windows and hardware-based hard disk encryption from Intel.
nb: Eksempler på dette er FileVault for MacOS, BitLocker for Windows og maskinvarebasert harddiskkrypto fra Intel.

source: It should be designed for security.
nb: Det er designet for sikkerhet.

source: The Working Party have also made some assessments of
nb: bruk av lokasjonsdata eller bruk av ansiktsgjenkjenning.

source: OWASP testing guide to OWASP’s top 10 vulnerabilities, SANS/CIS 20 vulnerabilities White box fuzz testing Burp suite and burp repeater for code review Bug bash and “Feedback Hub”.
nb: OWASP testing guide mot OWASP top 10 sårbarheter, SANS/CIS 20 sårbarheter Whitebox fuzz testing Burp suite og burp repeater for kodegjennomgang Bug bash og «Feedback Hub»

source: The document containing our list is based on these guidelines and the criteria set out in the guidelines.
nb: Bakgrunn for senre igangsetting vil normalt være endringer av betydning for informasjonssikkerheten.

source: For symmetric confidentiality protection, the recommendation is for AES with a 128 or 256-bit key.
nb: Som symmetrisk konfidensialitetsbeskyttelse anbefales AES med 128 eller 256 bits nøkkel.

source: Implement a regime for automatic execution of test sets before release, such as
nb: Ha regime for automatisk kjøring av testsett før produksjonssetting, for eksempel

source: The DNA Informed Consent Agreement applies to the sharing of DNA-results with MyHeritage for research purposes.
nb: Behandling av helseopplysninger i kvalitetsregistre vil nesten utelukkende måtte underlegges en slik vurdering.

source: These children have a high need for protection, and in the extreme, life and health could have been in danger, says Thon.
nb: Desse barna har et høgt behov for beskyttelse, og i ytterste konsekvens kunne liv og helse ha vorte sett i fare, seier Thon.

source: Data protection by design and by default helps ensure that the information systems we use fulfil these data protection principles, and that the systems safeguard the rights of data subjects.
nb: Innebygd personvern skal sørge for at informasjonssystemene vi bruker oppfyller personvernprinsippene, og at de ivaretar de registrertes rettigheter.

source: One example could be detection, analysis, reporting, handling, and normalising.
nb: Det kan for eksempel være å detektere, analysere, rapportere, håndtere og normalisere.

source: Incident assessments should also follow this plan.
nb: Evaluering av hendelser bør følge planen.

source: Analyse and review the source code regularly, and each time it is built.
nb: Analyser og gjennomgå kildekoden regelmessig, og hver gang den bygges.

source: between the entity and a service provider (data processor or security system provider),
nb: mellom virksomheten og leverandør (databehandler eller sikkerhetspart),

source: Which authorities have access to SIS II data?
nb: Myndighetene har tilgang til opplysningene i SIS II

source: Maintenance, service and operation of the software
nb: Forvaltning, drift og vedlikehold av programvaren

source: The plan should also contain procedures for evaluating incident response (“lessons learned”).
nb: I tillegg bør planen omfatte rutiner for evaluering av hendelseshåndtering («lessons learned»).

source: Following this, measures to make the software more robust should be implemented.
nb: Deretter skal det implementeres tiltak som gjør programvaren mer robust.

source: Scanning with both Scan Master and Dev Brancher, and performing a full security
nb: Ved nybygging (On build scanning) sjekkes minimum sikkerhetskrav av Dev Brancher eller

source: Employees should know what requirements are applicable, what they should look out for, and which tools enables them to convert knowledge of data protection and information security into software that safeguards it.
nb: De ansatte må vite hvilke krav som gjelder, hva de skal se etter og hvilke verktøy som gjør dem i stand til å omsette kunnskap om personvern og informasjonssikkerhet til programvare som ivaretar dette.

source: Authority’s own guide on data protection impact
nb: behandling av personopplysninger på side på

source: This includes fairness, which is both an ethical principle and a principle for the processing of personal data, specified in Article 5 of the General Data Protection Regulation.
nb: Dette gjelder for eksempel rettferdighet, som både er et etisk prinsipp og et prinsipp for behandling av personopplysninger i artikkel 5 i personvernforordningen.

source: HTTPS is the most common format.
nb: Det er mest vanlig med HTTPS.

source: The list should be updated regularly with the most recognized and up-to-date algorithms and methods, and what key length is deemed sufficient.
nb: Listen bør regelmessig oppdateres med de mest anerkjente og oppdaterte algoritmer og metoder, og hvilken nøkkellengde som er tilstrekkelig.

source: interfaces with measurements that can support decisions on release management, check costs when changes occur, and provide information needed for maintenance).
nb: målinger som kan støtte avgjørelser om produksjonssetting, kontrollere kostnader ved endringer, og gi informasjon som er nødvendig for vedlikehold).

source: The Working Party believe the Data Protection
nb: Vurdere tilgjengeliggjøring av risikovurdering av

source: Vigilo contains a module where school and parents can communicate via a portal or app.
nb: Vigilo inneheld en modul der skule og foresatte kan kommunisere via en portal eller app.

source: Data stored in SIS II are the data necessary to identify a person (including picture and ­ fingerprints) as well as relevant information about the alert (including the action to be taken).
nb: I SIS II lagres informasjonen som er nødvendig for å identi­fisere en person (inkludert bilde og ­fingeravtrykk) og relevant informasjon om varselet (inkludert tiltakene som skal iverksettes).

source: “Unlawful hacking of voicemail inboxes using ‘spoofing’ services has been a known problem for years.
nb: - Urettmessig hacking av talepostkasser ved bruk av «spoofing-tjenester» har vært et kjent problem i en årrekke.

source: Keys must be created and used in hardware for long-term storage (data at rest).
nb: Nøkler må lages og brukes i hardware for langtidslagring (data at rest).

source: servers, networks, endpoints, etc.
nb: applikasjoner, server, nettverk, endepunkt med mer

source: It should have a response centre that can handle incidents and deliver updates, guidelines, and information to users and data subjects.
nb: Virksomheten må være forberedt påå håndtere hendelser, avvik og angrep som kan medføre konfidensialitets-, integritet- og tilgjengelighetsbrudd relatert til personopplysninger.

source: Age Labs is a young entrepreneurial company in predictive diagnostics.
nb: Age Labs er et ungt gründerselskap innenfor prediktiv diagnostikk.

source: It should be available for audits and inspections of the processing.
nb: Den må være tilgjengelig ved revisjon og kontroll av behandlingen.

source: RIPS PHP Static Code Analysis Tool, OWASP LAPSE+ Static Code Analysis Tool,
nb: RIPS PHP Static Code Analysis Tool OWASP LAPSE+ Static Code Analysis Tool SonarQube Eksempel på hvordan statisk kodeanalyse kan gjennomføres:

source: This checklist is dynamic, not exhaustive, and will be updated regularly.
nb: Sjekklisten er dynamisk, ikke uttømmende og skal oppdateres regelmessig.

source: During this activity, the software is prepared for release.
nb: I denne aktiviteten gjøres programvaren klar for produksjonssetting.

source: Follow the organisation’s procedures for maintenance, service and operation of the software.
nb: Sørg for å følge virksomhetens rutiner for forvaltning, drift og vedlikehold av programvaren.

source: o Test environments, such as code review of the application (testing for
nb: o Testmiljø, for eksempel kodegjennomgang av applikasjonen (testing av sårbarheter i

source: The response incident team should also know which priorities apply, as well as exactly what they can and should do in the event of a crisis.
nb: Responsteamet bør også vite hvilke prioriteringer som gjelder, og vite nøyaktig hva de kan og skal gjøre når det virkelig er krise.

source: Under the motto that employees who know how to protect themselves, also protect the company, Secure Practice offers services for cyber security to the business community.
nb: Under mottoet at ansatte som veit å beskytte seg selv, også beskytter selskapet, tilbyr Secure Practice tjenester for cybersikkerhet til næringslivet.

source: about the processing.
nb: systematisk og omfattende analyse av

source: This is particularly important if there is a need to transfer personal data over uncontrolled areas and networks.
nb: viktig dersom det er behov for overføring av personopplysninger over ukontrollerte områder og nettverk.

source: Data protection by default.
nb: Personvern som standard.

source: The plan should contain relevant contact information for support and escalation, including contact information for the organisation’s Data Protection Officer.
nb: Planen bør inneholde relevant kontaktinformasjon for bistand og eskalering, inkludert kontaktinformasjon til virksomhetens personvernombud.

source: (edps.europa.eu) and in the
nb: (edps.europa.eu) og i

source: For example, if you click on many property advertisements, more such advertisements will appear on the web pages you visit.
nb: I justissektoren finnes det flere tungtveiende hensyn som taler for at staten kan gripe inn i den enkeltes rettssfære.

source: Enrich and vary with photographs, icons, audio, video, etc to target users.
nb: Berik og varier med bilder, ikoner, lyd, video og så videre.

source: withdraw consent via a menu within the software.
nb: å kunne trekke tilbake et samtykke via en meny i programvaren.

source: Test functionality in running code by using tools or manual reviews to analyse how the software behaves in relation to different user permissions and in the cases of critical security failures.
nb: Test funksjonalitet i kjørende kode ved å bruke verktøy eller manuell gjennomgang som analyserer hvordan programvaren oppfører seg ved ulike brukerrettigheter og ved kritiske sikkerhetsfeil.

source: Disable unnecessary tracking, logging, and collection of personal data.
nb: Deaktiver unødig sporing, logging og innsamling av personopplysninger.

source: The security requirements for the software are determined by identifying which risks the software may be exposed to, and which risks the company is willing to take.
nb: Sikkerhetskravene til programvaren bestemmes ved å identifisere hvilken risiko programvaren kan være utsatt for og hvilken risiko virksomheten er villig til å ta.

source: processing personal data through the use of a
nb: Medieovervåking av personvernrelatert omtale av

source: The Data Protection Authority finds that Telenor Norge AS had not implemented satisfactory security measures.
nb: Datatilsynet mener at Telenor Norge AS ikke hadde iverksatt tilstrekkelige sikkerhetstiltak.

source: Examples of tools that can be used for security testing:
nb: Eksempler på verktøy som kan benyttes ved sikkerhetstesting:

source: Test that notification procedures exist and work, that notifications are acknowledged
nb: Test at varslingsrutiner finnes og fungerer, at mottak fungerer (for eksempel utarbeide et

source: Information security standards can help to detect vulnerabilities, thus also identifying the requirements that need to be established for data protection and security.
nb: Standarder for informasjonssikkerhet kan bidra til å avdekke sårbarheter og dermed også krav som må stilles til personvern og sikkerhet.

source: Employees must also know which methodology and routines should be followed.
nb: De ansatte må vite hvilken metodikk og hvilke rutiner som skal følges.

source: The list should be agreed upon and approved by the security advisor, and must be updated regularly.
nb: Listen bør samstemmes med og godkjennes av sikkerhetsrådgiver, og den må oppdateres regelmessig.

source: Examples include documentation demonstrating that the software has been developed using a methodology that ensures data protection by design and information security (SSDLC - Secure Software Development Life Cycle), reports from security audits, vulnerability scanning, security tests such as penetration testing, and reports on exercising data breach management.
nb: Eksempler er dokumentasjon som viser at programvaren er utviklet etter en metodikk som ivaretar innebygd personvern og informasjonssikkerhet, rapporter fra sikkerhetsrevisjoner, sikkerhetstester som penetrasjonstester og rapporter etter øvelser på hendelseshåndtering knyttet til personvern.

source: A threat assessment should be carried out to identify which actors could be interested in the values, and which attack vectors different threat actors use.
nb: Det bør gjøres en trusselvurdering av hvilke aktører som kan være interessert i verdiene og hvilke angrepsvektorer de ulike trusselaktørene benytter.

source: Parameters that can be iterated (e.g. ID=42, 43, 44, etc.) should be
nb: Alle parametere som kan itereres (eks. Id=42, 43, 44 etc.) skal itereres og sjekkes

source: whether abnormal activity, traffic, security incidents, and data
nb: om unormal og avvikende aktivitet, trafikk, sikkerhetshendelser og avvik er et

source: Smartere Utdanning advertises via e-mail and Facebook via so-called “targeted audiences”.
nb: Smartere Utdanning marknadsfører seg på e-post og på Facebook via såkalla «målretta publikum».

source: The list should also include which supporting components, and third-party components and development tools, are permitted for use during development.
nb: Listen bør også inneholde hvilke støttekomponenter, og komponenter og utviklingsverktøy fra tredjepart, som er tillatt å bruke under utvikling.

source: These support AES 256.
nb: Disse støtter AES 256.

source: outcomes for the data subject.
nb: Vi stiller likevel spørsmål om hvorvidt

source: The plan should contain defined resources and a contact point or response centre that can manage incidents.
nb: Planen bør omfatte definerte ressurser og et kontaktpunkt eller responssenter som kan håndtere hendelser.

source: During this activity, you must ensure that requirements for data protection and information security are reflected in the design.
nb: I denne aktiviteten skal dere sørge for at personvernkrav og sikkerhetskrav gjenspeiles i designet.

source: o Testing in production instances, such as application fuzzing, scanning for
nb: o Testing i produksjonsinstansen, for eksempel fuzzing av applikasjon, sårbarhetsskann og

source: Static code analysis and code review should be performed on a regular basis.
nb: Statisk kodeanalyse og kodegjennomgang skal gjøres regelmessig.

source: Establish guidelines for what should be scanned, and when.
nb: Etabler føringer for hva som skal skannes, og når.

source: You should also always investigate whether the same type of information is being collected or stored in multiple locations (duplicated functionality) and assess whether this functionality can be simplified.
nb: Undersøk om samme type informasjon samles inn flere steder (dupliserende funksjonalitet) og vurder om funksjonaliteten kan forenkles.

source: These cookies are necessary if you wish to use forms on our website.
nb: Disse er nødvendige dersom du ønsker å ta i bruk skjema på våre nettsider.

source: - Today we do it in a fairly harmless way, says Erlend Andreas Gjære, general manager of Secure Practice.
nb: -I dag gjør vi det på en ganske ufarlig måte, sier Erlend Andreas Gjære, daglig leder i Secure Practice.

source: the Norwegian Marketing Control Act.
nb: Anonymisering er å gjøre personopplysninger anonyme.

source: Incidents should be reported to a defined point of contact or response incident centre that handles internal and external incidents.
nb: Hendelser skal rapporteres til et definert kontaktpunkt eller responssenter, som håndterer interne og eksterne hendelser.

source: By testing use synthetic personal data to check correctness, lawfulness, fairness,
nb: Bruk syntetiske personopplysninger og sjekk riktighet, lovlighet, rettferdighet, formål,
